app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    if @item.save
---
INSERT INTO "items" ("name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "iPod"], ["price", "$59"], ["created_at", "2015-12-15 01:50:56.307567"], ["updated_at", "2015-12-15 01:50:56.307567"]]

  def update
    @item = Item.find(params[:id])
    if @item.update_attributes(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "items" SET "price" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["price", "$58"], ["updated_at", "2015-12-15 21:59:20.525035"], ["id", 1]]

  def destroy
    Item.find(params[:id]).destroy
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 2]]